In [1]:
import pandas as pd

df = pd.read_csv('Adj Close.csv')

In [2]:
df

           Date       ASX200        BHP  Reject shop (TRS)
0      1/3/2016  5270.500000  15.898844           9.630605
1      1/4/2016  5184.399902  15.702342           9.533148
2      1/5/2016  5123.100098  15.318267           9.719204
3      1/6/2016  5010.299805  14.585848           9.249632
4      1/7/2016  4990.799805  14.603714           9.063578
..          ...          ...        ...                ...
705  10/16/2018  5939.100098  33.660000           2.730000
706  10/17/2018  5942.399902  33.200001           2.630000
707  10/18/2018  5939.500000  33.099998           2.460000
708         NaN          NaN        NaN                NaN
709         NaN          NaN        NaN                NaN

[710 rows x 4 columns]

In [3]:
df.dropna(how='all',inplace=True)

In [4]:
df

           Date       ASX200        BHP  Reject shop (TRS)
0      1/3/2016  5270.500000  15.898844           9.630605
1      1/4/2016  5184.399902  15.702342           9.533148
2      1/5/2016  5123.100098  15.318267           9.719204
3      1/6/2016  5010.299805  14.585848           9.249632
4      1/7/2016  4990.799805  14.603714           9.063578
..          ...          ...        ...                ...
703  10/14/2018  5837.100098  33.340000           4.430000
704  10/15/2018  5869.899902  33.900002           4.470000
705  10/16/2018  5939.100098  33.660000           2.730000
706  10/17/2018  5942.399902  33.200001           2.630000
707  10/18/2018  5939.500000  33.099998           2.460000

[708 rows x 4 columns]

In [24]:
df['Date']

0        1/3/2016
1        1/4/2016
2        1/5/2016
3        1/6/2016
4        1/7/2016
          ...
703    10/14/2018
704    10/15/2018
705    10/16/2018
706    10/17/2018
707    10/18/2018
Name: Date, Length: 708, dtype: object

In [23]:
try:
     column = pd.to_datetime(df['Date'])
except:
    pass
else:
    if (column.dt.floor('d') == column).all():
        print('this is a date column')
    elif (column.dt.date == pd.Timestamp('now')).all():
        print('this is a time column')

this is a date column

In [9]:
column

0     2016-01-03
1     2016-01-04
2     2016-01-05
3     2016-01-06
4     2016-01-07
         ...
703   2018-10-14
704   2018-10-15
705   2018-10-16
706   2018-10-17
707   2018-10-18
Name: Date, Length: 708, dtype: datetime64[ns]

In [14]:
(column.dt.floor('d') == column).all()

True

In [16]:
column

0     2016-01-03
1     2016-01-04
2     2016-01-05
3     2016-01-06
4     2016-01-07
         ...
703   2018-10-14
704   2018-10-15
705   2018-10-16
706   2018-10-17
707   2018-10-18
Name: Date, Length: 708, dtype: datetime64[ns]

In [21]:
(column.dt.date == pd.Timestamp('now')).all()

False